#!/bin/sh

# usage: sh ansi-colors.sh

# 前景色・太字・背景色

printf '\033[39m%s\033[39m\t' '前景色がデフォルト'
printf '\033[1m\033[39m%s\033[39m\033[0m\t' '前景色がデフォルトの太字'
printf '\033[49m%s\033[49m\n' '背景色がデフォルト'

printf '\033[30m%s\033[39m\t\t' '前景色が黒'
printf '\033[1m\033[30m%s\033[39m\033[0m\t\t' '前景色が黒の太字'
printf '\033[40m%s\033[49m\n' '背景色が黒'

printf '\033[31m%s\033[39m\t\t' '前景色が赤'
printf '\033[1m\033[31m%s\033[39m\033[0m\t\t' '前景色が赤の太字'
printf '\033[41m%s\033[49m\n' '背景色が赤'

printf '\033[32m%s\033[39m\t\t' '前景色が緑'
printf '\033[1m\033[32m%s\033[39m\033[0m\t\t' '前景色が緑の太字'
printf '\033[42m%s\033[49m\n' '背景色が緑'

printf '\033[33m%s\033[39m\t\t' '前景色が黄'
printf '\033[1m\033[33m%s\033[39m\033[0m\t\t' '前景色が黄の太字'
printf '\033[43m%s\033[49m\n' '背景色が黄'

printf '\033[34m%s\033[39m\t\t' '前景色が青'
printf '\033[1m\033[34m%s\033[39m\033[0m\t\t' '前景色が青の太字'
printf '\033[44m%s\033[49m\n' '背景色が青'

printf '\033[35m%s\033[39m\t' '前景色がマゼンタ'
printf '\033[1m\033[35m%s\033[39m\033[0m\t\t' '前景色がマゼンタの太字'
printf '\033[45m%s\033[49m\n' '背景色がマゼンタ'

printf '\033[36m%s\033[39m\t\t' '前景色がシアン'
printf '\033[1m\033[36m%s\033[39m\033[0m\t\t' '前景色がシアンの太字'
printf '\033[46m%s\033[49m\n' '背景色がシアン'

printf '\033[37m%s\033[39m\t\t' '前景色が白'
printf '\033[1m\033[37m%s\033[39m\033[0m\t\t' '前景色が白の太字'
printf '\033[47m%s\033[49m\n' '背景色が白'

printf '\n'

# その他

printf '\033[7m%s\033[0m\t' '文字色と背景色の反転'
printf '\033[5m%s\033[0m\t\t\t' 'ブリンク'
printf '\033[6m%s\033[0m\n' '高速ブリンク'

printf '\033[2m%s\033[0m\t\t' '薄く表示'
printf '\033[3m%s\033[0m\t\t\t' 'イタリック'
printf '\033[4m%s\033[0m\n' 'アンダーライン'

exit 0

# ref.
# ANSI エスケープシーケンス チートシート
# https://qiita.com/PruneMazui/items/8a023347772620025ad6

# vim: set et sw=4 sts=4 :
